app/controllers/books_controller.rb

  def index
	@book = Book.order("created_at DESC")
---
SELECT `books`.* FROM `books`  ORDER BY created_at DESC

  def save
  @book = Book.new(params.require(:book).permit(:Name, :Subject, :Quantity, :Class))
  @book.save
---
INSERT INTO `books` (`Name`, `Subject`, `Quantity`, `Class`, `created_at`, `updated_at`) VALUES ('aamir', 'urdu', '4', '2', '2017-09-03 07:40:11', '2017-09-03 07:40:11')

  def update

  @book = Book.find(params[:id])
  @book.update_attributes(params.require(:book).permit(:Name, :Subject, :Quantity, :Class))
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 23 LIMIT 1
UPDATE `books` SET `Name` = 'aamir-edit', `updated_at` = '2017-09-03 09:30:45' WHERE `books`.`id` = 23

	def delete
	@book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1