app/controllers/register_controller.rb

INSERT INTO `registers` (`Name`, `Quantity`, `Subject`, `Class`, `created_at`, `updated_at`) VALUES ('boob', '12', 'urdu', '8', '2017-09-05 17:20:17', '2017-09-05 17:20:17')
---
  def create
  @register = Register.new(params.require(:register).permit(:Name,:Quantity,:Subject, :Class))
  @register.save

SELECT `registers`.* FROM `registers`  ORDER BY created_at DESC
---
  def index
	@register = Register.order('created_at DESC')

SELECT  `registers`.* FROM `registers` WHERE `registers`.`id` = 1 LIMIT 1
---
  def show
  @register = Register.find(params[:id])

SELECT  `registers`.* FROM `registers` WHERE `registers`.`id` = 15 LIMIT 1
---
  def edit
  @register = Register.find(params[:id])

SELECT  `registers`.* FROM `registers` WHERE `registers`.`id` = 1 LIMIT 1
UPDATE `registers` SET `Name` = 'shafiq', `Subject` = 'english', `updated_at` = '2017-09-05 18:39:02' WHERE `registers`.`id` = 1
---
  def update
	@register = Register.find(params[:id])
	@register.update_attributes(params.require(:register).permit(:Name, :Quantity, :Subject, :Class))

SELECT  `registers`.* FROM `registers` WHERE `registers`.`id` = NULL LIMIT 1
---
  def delete
	@register_delete = Register.find(params[:id])

SELECT  `registers`.* FROM `registers` WHERE `registers`.`id` = 0 LIMIT 1
DELETE FROM `registers` WHERE `registers`.`id` = 21
---
  def destroy
	@register_delete = Register.find(params[:id])
	@register_delete.destroy