app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`  ORDER BY created_at DESC
---
  def index
	@subjects = Subject.order("created_at DESC")

INSERT INTO `subjects` (`Name`, `Position`, `Visible`, `created_at`, `updated_at`) VALUES ('subject test', 25, 0, '2017-08-29 20:52:14', '2017-08-29 20:52:14')
---
  def create
	@subject = Subject.new(params.require(:subject).permit(:Name, :Position, :Visible))

	if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = NULL LIMIT 1
UPDATE `subjects` SET `Name` = 'Subject-edit', `Position` = 2, `updated_at` = '2017-09-01 07:14:31' WHERE `subjects`.`id` = 1
---
  def update
	@subject = Subject.find(params[:id])
		@subject.update_attributes(params.require(:subject).permit(:Name, :Position, :Visible))

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 6
---
  def destroy
	@subject = Subject.find(params[:id])
	@subject.destroy